RT-Thread/rt-thread/bsp/freescale/platform/system/src/clock/MK80F25615/fsl_clock_MK80F25615.c
/* SPI instance table. */
static const sim_clock_gate_name_t spiGateTable[] =
{
    kSimClockGateSpi0,
    kSimClockGateSpi1,
    kSimClockGateSpi2
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableSpiClock
 * Description   : Enable the clock for SPI module
 * This function enables the clock for SPI moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableSpiClock(uint32_t instance)
{
    assert(instance < sizeof(spiGateTable)/sizeof(spiGateTable[0]));

    SIM_HAL_EnableClock(SIM, spiGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableSpiClock
 * Description   : Disable the clock for SPI module
 * This function disables the clock for SPI moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableSpiClock(uint32_t instance)
{
    assert(instance < sizeof(spiGateTable)/sizeof(spiGateTable[0]));

    SIM_HAL_DisableClock(SIM, spiGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetSpiGateCmd
 * Description   : Get the the clock gate state for SPI module
 * This function will get the clock gate state for SPI moudle.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetSpiGateCmd(uint32_t instance)
{
    assert(instance < sizeof(spiGateTable)/sizeof(spiGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, spiGateTable[instance]);
}

/* I2C instance table. */
static const sim_clock_gate_name_t i2cGateTable[] =
{
    kSimClockGateI2c0,
    kSimClockGateI2c1,
    kSimClockGateI2c2,
    kSimClockGateI2c3,
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableI2cClock
 * Description   : Enable the clock for I2C module
 * This function enables the clock for I2C moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableI2cClock(uint32_t instance)
{
    assert(instance < sizeof(i2cGateTable)/sizeof(i2cGateTable[0]));

    SIM_HAL_EnableClock(SIM, i2cGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableI2cClock
 * Description   : Disable the clock for I2C module
 * This function disables the clock for I2C moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableI2cClock(uint32_t instance)
{
    assert(instance < sizeof(i2cGateTable)/sizeof(i2cGateTable[0]));

    SIM_HAL_DisableClock(SIM, i2cGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetI2cGateCmd
 * Description   : Get the the clock gate state for I2C module
 * This function will get the clock gate state for I2C moudle.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetI2cGateCmd(uint32_t instance)
{
    assert(instance < sizeof(i2cGateTable)/sizeof(i2cGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, i2cGateTable[instance]);
}

/* Lpuart instance table. */
static const sim_clock_gate_name_t lpuartGateTable[] =
{
    kSimClockGateLpuart0,
    kSimClockGateLpuart1,
    kSimClockGateLpuart2,
    kSimClockGateLpuart3,
    kSimClockGateLpuart4
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableLpuartClock
 * Description   : Enable the clock for LPUART module
 * This function enables the clock for LPUART moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableLpuartClock(uint32_t instance)
{
    assert(instance < sizeof(lpuartGateTable)/sizeof(lpuartGateTable[0]));

    SIM_HAL_EnableClock(SIM, lpuartGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableLpuartClock
 * Description   : Disable the clock for LPUART module
 * This function enables the clock for LPUART moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableLpuartClock(uint32_t instance)
{
    assert(instance < sizeof(lpuartGateTable)/sizeof(lpuartGateTable[0]));

    SIM_HAL_DisableClock(SIM, lpuartGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_GetLpuartGateCmd
 * Description   : Get the the clock gate state for LPUART module
 * This function will get the clock gate state for LPUART moudle.
 *
 *END**************************************************************************/
bool CLOCK_SYS_GetLpuartGateCmd(uint32_t instance)
{
    assert(instance < sizeof(lpuartGateTable)/sizeof(lpuartGateTable[0]));

    return SIM_HAL_GetGateCmd(SIM, lpuartGateTable[instance]);
}

/* Emvsim instance table. */
static const sim_clock_gate_name_t emvsimGateTable[] =
{
    kSimClockGateEmvsim0,
    kSimClockGateEmvsim1
};

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_EnableEmvsimClock
 * Description   : Enable the clock for EMVSIM module
 * This function enables the clock for EMVSIM moudle
 *
 *END**************************************************************************/
void CLOCK_SYS_EnableEmvsimClock(uint32_t instance)
{
    assert(instance < sizeof(emvsimGateTable)/sizeof(emvsimGateTable[0]));

    SIM_HAL_EnableClock(SIM, emvsimGateTable[instance]);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CLOCK_SYS_DisableEmvsimClock
 * Description   : Disable the clock for EMVSIM module
 * This function enables the clock for EMVSIM moudule
 *
 *END**************************************************************************/
void CLOCK_SYS_DisableEmvsimClock(uint32_t instance)
{
    assert(instance < sizeof(emvsimGateTable)/sizeof(emvsimGateTable[0]));

